{
  "title": "曾国藩",
  "cells": [
    {
      "type": "text",
      "data": "<p>久利之事勿为，众争之地勿往；勿以小恶弃人之大美，勿以小怨忘人大恩；说人之短乃护己之短，夸己之长乃忌人之长；凡办大事，以识为主，以才为辅；凡成大事，人谋居半，天意居半；天下古今之庸人，皆以一惰致败，天下古今之才人，皆以一傲致败；利可共而不可独，谋可寡而不可众；</p>\n<h2><strong>第一戒：久利之事勿为，众争之地勿往</strong></h2>\n<p>一直都能获利的事不要做，所有人都想得到的地方不要前去。危城莫入！所有人都向往渴求的，可能有有害。</p>\n<p>前半句说：不可贪求过多！日中则移，月满则亏，物盛则衰。世界上没有一劳永逸的事情，也不可能有长久获利的事情，如果有这种能够一直获利的事情，那只能说这种事是表面现象或者骗局，这时候一定要保持头脑清。</p>\n<p>后半句是说的安全，众人争执、争斗的地方你不要去，容易惹麻烦或者招致祸患。《论语》上说，“危邦不入，乱邦不居”就是这个意思。当然，这句话里的争，也可以理解为，争利。意思是说，大家都去争抢的利益，你就不要去争抢了，因为那肯定是薄利。</p>\n<h2><strong>第二戒：勿以小恶弃人大美，勿以小怨忘人大恩</strong></h2>\n<p>不要因为别人小的缺点就忽视他的优点，不要因为小小的恩怨就忽略了别人的大恩。</p>\n<p>人只要做事就会犯错，这两句话都是告诉我们，不要因为别人的一点小过失，一点道德上的小瑕疵，一点小恩怨，就全盘否定别人的好，忘记别人的恩情。</p>\n<p>《礼记》上说， “好而知其恶，恶而知其美者，天下鲜矣。”意思是喜爱一个人而知道其缺点，厌恶而知道其优点。这就是告诫我们，在待人接物的时候，一定不要太感情用事，一定要客观、公正地看待别人的缺点和不足。</p>\n<h2><strong>第三戒：说人之短乃护己之短，夸己之长乃忌人之长</strong></h2>\n<p>经常说别人短处的人，经常夸耀自己长处的人，可以说是“存心不厚，识量太狭。”俗话说，“打人不打脸，揭人不揭短。”经常谈论别人的短处，夸耀自己的长处，不仅是情商低的表现，也必然给自己招来怨恨，埋下祸乱的种子。</p>\n<p>汉高祖刘邦曾经随便和韩信讨论各位将领的才能。刘邦问道：“像我自己，能带多少士兵？”韩信说：“陛下不过能带十万人。”刘邦说：“那对你来说呢？”韩信回答：“像我，越多越好。”韩信后来被杀，不能说与他这种性格无关。</p>\n<p>曾国藩这句话的意思，入目三分地画出了可这种人的精神肖像。<strong>那种经常谈论别人缺点的人，内心其实是借此在掩饰自己的缺点；经常夸耀自己长处的人，内心其实是嫉妒或者想掩盖别人的长处罢了。</strong></p>\n<h2><strong>第四戒：利可共而不可独，谋可寡而不可众</strong></h2>\n<p>利益，往往是众人都渴望得到的，如果谁独占了利益而不与大家分享，那么一定会招致怨恨，甚至成为众矢之的。刘邦攻破咸阳，却不敢占据其地；曹操能够“挟天子以令诸侯”，却终其一生不敢篡汉自立，他们都是怕成为众矢之的。所以，面对利益，一定要权衡取舍之道。</p>\n<p>谋划事情，一定要跟有主见的几个人一起，而不要与众人一起谋划事情。正如《战国策》上说，“论至德者不和于俗，成大功者不谋于众。”通俗地说，就是谋求特别重大的事情，不必与众人商量。因为谋求大事的人，自己必定有非同一般的眼光、心胸与气度，自己看准了，去做就是了，如果和别人商量，反倒麻烦。如果别人见识低下，心胸狭小，气度平凡，必定不理解你的想法。七嘴八舌，会动摇你的意志，也会破坏你的信心和情绪。</p>\n<h2><strong>第五戒：天下古今之庸人，皆以一惰字致败，天下古今之才人，皆以一傲字致败</strong></h2>\n<p>庸人，就是普通人，一般的人。对于一般的人来说，没有什么才气，只有勤奋工作才能成就事业，所以最忌讳一个“懒”字。。而那些有才的人呢，虽然可凭才气走捷径，更容易成功，但也容易孤傲自大，故步自封，不肯向别人学习，这也是容易失败的。</p>\n<p>曾国藩是勤劳的好例子，他其实并不聪明，但是却能以“勤”成就大学问和大事业，可以说正是普通人的榜样。而如项羽、李自成等，占尽天时地利，却因为骄傲而败亡。</p>\n<h2><strong>第六戒：凡办大事，以识为主，以才为辅；凡成大事，人谋居半，天意居半</strong></h2>\n<p>凡是办大事，首先需要有深厚的阅历和识见，并以才能作为辅助；凡是要成就大事的，一半在于人的谋划，另一半就要看天意了，看时机会不会来到。所谓谋事在人，成事在天。</p>\n<p>曾国藩明确告诉我们，<strong>办大事要以“识”为主，才气、才能不过是辅助罢了。所以恃才傲物的人，往往难以成就大事。当然这里的“识”，不单单指知识，更指的是经验和见识。</strong></p>\n<p>而“人谋居半，天意居半。”则是说，我们无论做什么事情，都要抱着“尽人事以听天命”的态度。不要因为有自己不能左右的的因素就不去努力，更不能因为自己努力了，最终却失败了而去怨天尤人。</p>\n<p><strong>曾国藩：一勤天下无难事</strong></p>\n<p>作者：罗日荣 来源：《文史月刊》2014年06期</p>\n<p>曾国藩说为官者当有五勤：“一曰身勤：险远之路，身往验之；艰苦之境，身亲尝之。二曰眼勤：遇一人，必详细察看；接一文，必反复审阅。三曰手勤：易弃之物，随手收拾；易忘之事，随笔记载。四曰口勤：待同僚，则互相规劝；待下属，则再三训导。五曰心勤：精诚所至，金石亦开；苦思所积，鬼神迹通。”</p>\n<p><strong>曾国藩的“五勤”之道虽是为官之道，同时也是为人处世之道：</strong></p>\n<p><strong>一曰身勤：</strong></p>\n<p>曾国藩所说的“身勤”就是身体力行、以身作则。</p>\n<p>曾国藩曾说“余谓天子或可不亲细事，为大臣者则断不可不亲”。</p>\n<p>曾国藩是这么说的，也是这么做的。曾国藩在军中要求自己早起，不论是什么样的天气，不论是什么样的环境，他一定“闻鸡起舞”，练兵督训，办理各项事务。曾国藩对军中将士说：“练兵之道，必须官弁昼夜从事，乃可渐几于熟。如鸡孵卵，如炉炼丹，未可须臾稍离。”《论语》有曰：“其身正，不令而行；其身不正，虽令不从。”</p>\n<p>言传不如身教，曾国藩就是这样影响手下的幕僚、将领的。不管是个人修行还是管理团队，这一点至关重要，要给周围的人和下属做一个好榜样。</p>\n<p><strong>二曰眼勤：</strong></p>\n<p>曾国藩所说的“眼勤”是从细微之处识人。</p>\n<p>曾国藩指派李鸿章训练淮军时，李鸿章带了三个人求见，请曾国藩分配职务给他们。不巧曾刚好饭后出外散步，李命三人在室外等候，自己则进入室内。等到曾散步回来，李请曾传见三人。</p>\n<p>曾说不用再召见了，并对李说：“站在右边的是个忠厚可靠的人，可委派后勤补给工作；站在中间的是个阳奉险违之人，只能给他无足轻重的工作；站在左边的人是个上上之材，应予重用。”</p>\n<p>李惊问道：“您是如何看出来的呢？”</p>\n<p>曾笑道：“刚才我散步回来，走过三人的面前时，右边那人垂首不敢仰视，可见他恭谨厚重，故可委派补给工作。中间那人表面上必恭必敬，但我一走过，立刻左顾右盼，可见他阳奉阴违，故不可用。左边那人始终挺直站立，双目正视，不亢不卑，乃大将之材。”</p>\n<p>曾国藩所指左边那位“大将之材”，就是后来担任台湾巡抚鼎鼎有名的刘铭传。</p>\n<p>曾国藩从细微之处识人，练就了他的一双慧眼，曾府幕僚鼎盛一时，幕僚在曾国藩平定太平军的过程中出谋划策，立下了赫赫功勋。</p>\n<p><strong>三曰手勤：</strong></p>\n<p>曾国藩所说的“手勤”其实就是要养成一个好习惯。</p>\n<p>曾国藩一生养成了三个好习惯：</p>\n<p>一是反省的习惯：曾国藩每一天都写日记，曾国藩说：“吾人只有进德、修业两事靠得住。进德，则孝弟仁义是也；修业，则诗文作字是也。此二者由我作主，得尺则我之尺也，得寸则我之寸也。今日进一分德，便算积了一升谷；明日修一分业，又算馀了一文钱；德业并增，则家私日起。至于功名富贵，悉由命走，丝毫不能自主。”曾国藩通过写日记进行修身，反思自己在为人处世等方面存在的不足，通过这样的反省，不断修炼自己。</p>\n<p>第二个好习惯就是读书习惯，他规定自己每一天必须坚持看历史不下十页，饭后写字不下半小时。曾国藩说“人之气质，由于天生，很难改变，唯读书则可以变其气质。古之精于相法者，并言读书可以变换骨相。”通过坚持读书，曾国藩不仅改变了气质，更磨练了他持之以恒的精神，同时也增长了他的才干，懂得不少为人处世的道理，也让他成了一代大儒。</p>\n<p>第三个好习惯就是写家书，据说曾国藩仅在1861年就写了不下253封家书，通过写家书不断训导教育弟弟和子女，在曾国藩的言传身教之下，曾家后人人才辈出。</p>\n<p>正所谓习惯决定性格，性格决定命运。曾国藩养成很好的习惯，不仅成就了曾国藩自己，也影响了曾家后人。</p>\n<p><strong>四曰口勤：</strong></p>\n<p>曾国藩的“口勤”就是他与人的相处之道。</p>\n<p>曾国藩认为同僚相处“两虎相斗，胜者也哀”。</p>\n<p>据说曾国藩开始同湖南巡抚骆秉章的关系并不好，咸丰三年，曾国藩在长沙初办团练时，骆秉章压根儿就没把曾国藩放在眼里，对曾国藩的工作也不是十分支持。当绿营与团练闹矛盾时，他总是把偏向着绿营。</p>\n<p>让曾国藩特别愤愤不平的是，在靖港兵败，湘军退驻长沙城郊的水陆洲时，骆秉章来到离曾国藩座船仅数十米之遥的码头送客，曾国藩以为他是特意来看望和安慰自己的，内心正十分感激，谁知他送完客人之后竟然转身便走，就当没有看到曾国藩！并且还同长沙官员一起对曾国藩的兵败百般讥讽。</p>\n<p>尽管如此，曾国藩并没有逞口舌之争，而是采取曲意忍让的态度，在他为父守孝后第二次出山之时，他特意拜访了骆秉章，态度十分谦恭又十分热情，之前的那点事就当没发生一样。这让骆秉章大感意外，当场表态，以后湘军有什么困难，我们湖南当倾力相助。</p>\n<p>“己预立而立人，己欲达而达人”，曾国藩口勤不仅仅是对同僚和上级，对下属也会耐心地训导，曾国藩秉持的这种为人处世之道，不仅让他成就了自己，也成就了如李鸿章、左宗棠、张之洞、刘铭传、胡林翼等名臣，实现了清末短暂的中兴。</p>\n<p><strong>五曰心勤：</strong></p>\n<p>曾国藩所说的“心勤”其实就是坚定的意志品质。</p>\n<p>曾国藩不管是从科考还是在平定太平军时“屡败屡战”，都有一种精诚所至的信念在支撑他。从各方面下足工夫，功到自然成。</p>\n<p>曾国藩说“天下古今之庸人，皆以一惰字致败。”以勤治惰，以勤治庸，不管是修身自律，还是为人处世，一勤天下无难事。</p>\n"
    }
  ]
}