{
  "title": "历程",
  "cells": [
    {
      "type": "text",
      "data": "尊敬的王总:<div>&nbsp; &nbsp; 对不起，由于我的无知和鲁莽做了很多错事。我这人说不行，但是写的能力还是可以的。我们沟通过程中很多问题其实我都没用表达清楚，逻辑结构混乱。当然这是我的问题。但是我还想就有些问题深入阐明，因为我觉得我们之间的沟通已经建立在了不信任、猜忌的基础上了。沟通是无效的，我所做的工作也基本是无效的。所有我用这篇文章来阐明我的一些想法和我的心路历程。</div>"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 我刚来到小虎，我对这里充满了憧憬。说实话，我一开始觉得这里非常不错。记得刚来的时候，招聘就问我，你打算在小虎做多久？我回答说：5年。也问我为什么不去阿里这些大企业？我说：“我想做点事，大企业里已经没有我的用武之地”。但是随着工作进行，我发现我太单纯了，我所在的部门不是我第一次看到的那样，表面上风平浪静积极向上，实则暗流涌动。我非常不喜欢这种环境。"
    },
    {
      "type": "text",
      "data": "<div>&nbsp; &nbsp; 工作继续开展，我相继介入了壹财富、壹财宝的开发。在壹财宝的开发过程中，我明显感觉我们的领导在吸取新意见方面的问题。有很多提的好的意见都被否了，我很是不理解？实际的效果也是，完全不像我们领导所讲的一样，我们真没有玩出什么新花样。大家一拥而上，熬夜加班，周末赶制下周的需求，这一切的过程中我都没发现我们张总有很强的前瞻统筹的能力，所以有时候我就挑战张总，几次还让他下不来台，这是我的问题。当然，站在一个员工角度，我这就是狗拿耗子，多此一举，我是一个兵，我拿我的钱做我的事就可以了。但是站在我的角度想不是，虽然我的人生还很长。&nbsp;</div>"
    },
    {
      "type": "text",
      "data": "<div>&nbsp; &nbsp; 去年年末，壹财宝停了，我明显感觉很多人内心躁动，说真的这个时候我也想走。我实在忍不住了，所以我向张洁反应了问题。但是没有效果，于是我直接向你反应了问题。说真的，我现在觉得我的举动是错的，当时justin提醒过我，我完全不应该向你反应问题，我应该向justin和其他人一样选择直接离开，因为我的这个举动，让你觉得我是在搞人事斗争，这真的让我很伤心。好几次我在楼梯口都碰到娟姐，看我的眼神都是一瓢而过，害怕多停留一分钟。我知道这意味着什么。所以我从去年开始我就时刻准备着离开公司，随时都可以走，中途有人给我介绍阿里巴巴等其他公司，但是我还是没有走，甚至都没去面过试，因为我觉得我还是想做点事。我一直都忍着。 &nbsp;&nbsp;</div>"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 今年六月，我向你提出了我想自己出去做的想法。为什么？为什么我有时间去研究那些东西？是因为我工作不努力？因为我没有工作可做。自从去年以来，我基本不提意见，尤其是不对张总提意见，我尽量保持低调，甚至我都不跟同事去吃饭。但是我看的的是，不管张总管那个部门，哪个部门看起来还可以但实际的效率都在下降，跟我们那时一样，一整天一整天的开会，但问题没见解决多少，哪个创业团队需要开那么多的会？我们没有需求可做这是事实，在上个月我们将近休息了两周。在我心里，我真心觉得，我在这里成就不了什么事情。就包括最近，我们整个需求之混乱，没有头绪，全部都在搞修修补补的工作，今天调个样式，明天改个界面。我想说，如果靠这些能够为公司创造价值，让公司走向成功，那很多互联网创业公司今天都会活的很好。所以我对张总的不满从根本上是对他做事能力和做事风格的不满，没有权利斗争上的不满。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 几乎每次我跟你聊天我都会说到张总，这是我的问题，我的心胸还不够宽大。就像你说的，作为一个下属我无权去评论领导的功和过，也无权去干预领导的是与非。这也是我的问题，是我的职场无知。我听张总说过好多次，我们需要心智成熟的人，我知道他觉得我心智不成熟，但是我想问什么叫心智成熟，如果把看到问题不讲、不说、不解决叫心智成熟，我宁愿还是不要成熟，如果是心智成熟是对领导阿玉奉承以求上升，我永远也算不上成熟。我知道我这人对外界事物敏感，但我绝对不是你说的什么玻璃心易碎，我真正缺乏的是像你说的需要内心的融合。虽然张总表面上不在你面前说我，甚至有时还表扬几句，而他给我打高分，是我努力为团队做事的结果。但是私下里他手下的小动作不断，我回去休假十多天，来了我就发现我推荐过来的朋友已经不是我的朋友，每次出去吃饭都在不断的挑战我，这都是以前没有发生过的。九天我重构了十多个页面，但是张总没让我参加过一次关于九天的需求会议（他手下主动通知我不参加），他手下甚至对团队其他人说我只做过一个首页。对于这些现象，我没有做过度的解读，我也不辩解，我身边的同事知道是什么情况。这些我都可以不管，我做我的，你做你的，但是我时刻感受到的是不安全。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 最近，我反复给你打电话，我真的坐不住了，我想做点事。我知道这是大忌，我也做好了最坏的准备，我在我QQ上签名写着“做正确的事，等着被开除”。我想这是我最后的挣扎，如果不行，我就应该离开了。那天我在微信群里面看到了你写的一段话：“板凳要坐十年冷，烧不死的鸡是凤凰”。于我的处境很像，但是站在我的角度，我即便是要坐冷板凳，我也会选择到别的地方去坐，比如阿里，在那里坐十年冷板凳再出来，也许我就成了凤凰，但在这里不会，在技术上我得不到任何的指导，努力学习被认为是没与团队保持一致而受到压制（张总说：“一个人走得快不叫快，要团队走的快”。都对，但难道别人打游戏我也要跟着打游戏，我应该停下来等着别人跟我一起成长）。但是我还是鼓起勇气给你打了电话，虽然你可能不太愿意接。我不想成为那只等死的凤凰。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 昨天我跟你提到了李洪彪，我讲了一句最不该讲的话，这犯了大忌，我觉得您应该反思。话还没讲完，显然你非常不高兴。为什么？你在公司权利太大了，整个公司全在你的掌控之中，当然您是创始人，这无可厚非，我也不知道这是好事还是坏事，但是起码这不利于做事。虽然你说你的包容并蓄的能力很强，但是我很多次经过我调查思考的出来的结论，你虽然没否定，但也没有深入思考，我相信在其他人那里也存在这个问题。就像我和其他人跟张总提的意见一样，他想都不想就直接否决掉了，这显然非常不利于做事的。我好几次跟你提到战略和营销问题，你有点不高兴，这里我也有点僭越了我的职权，就像你说的我的工作应该是在解决需求场景问题上，不是考虑这些问题。但是在我的理解中，这些问题是一个问题，没有战略设想就没有战役布局，没有战役布局就没有小的局部战斗，战略、经营、营销与需求，这些都是密不可分的，是一个问题。没有一个良好的顶层设计通盘考虑这些问题，即便我在需求场景化这个战斗中打得再好，对大局于事无补的（壹财宝就是典型的例子）。就如我建议你考虑合并部门，如果这个动作先行，我们在产品需求和研发上面的就会完全不一样的。如果先引入半客服，我们就得要为三个角色（客服、产品经理、服务经理）设计的功能，研发进度上就会很慢，但我觉得不见得有效。如果合并，我们就只需要为一个角色（产品经理）设计功能，研发进度就会快很多，即便不行，我们也能快速转弯。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 在很多大公司中，战略这种问题被当做是管理者的特权，小人物是没有权利染指的。但是在创业公司，面对快速变化的市场和情况，一线人员、底层人员往往更具有发言权。我说你很多时候看不到真实情况，也是这个原因。你觉得你离真实很近，但是很多时候你离真实很远，因为你想看到的都看不到，呈现在你面前的是别人想给你看的。我很喜欢、向往“罗辑思维”这家公司，它甚至连官网都没有，但不可否认它是一家真正的有创新的互联网公司，他的创始人可以几个月不用上班，但公司照样可以保持快速的增长，这里面拥有无数个小的战略决策者。那次我跟你说我们公司需要的是有想法的人，虽然这种人不好管，但是这种人能产生创新价值，而在互联网研发中心，这样的人不多，大多是一些非常听话的顺民或是不愿多说职场老手。"
    },
    {
      "type": "text",
      "data": "&nbsp; &nbsp; 说了这么多，如果你认为我是一个可用之人，那就请你摈弃成见，相信我，重用我，给与我更多的自由度，我不要权利，更不会为了权利去内斗，也不要高的薪水，我掌握的知识和能力，我相信会为公司带来价值。如果你认为我孺子不可教、不可用，我主动走。"
    }
  ]
}