{
  "title": "主要",
  "cells": [
    {
      "type": "text",
      "data": "尊敬的王总：<div>&nbsp; &nbsp; &nbsp; &nbsp; 非常抱歉王总，屡次三番的来打扰您，现在我已经不好意思再给您打电话了。但此时心情五味杂陈。前两次跟你打电话，我心情都比较急，有些问题表达不清，有些问题表达过激，还有些问题遗漏，一直都没有机会跟你表达。我觉得我现在心态已经不太正常了，但是我还是觉得这些话我需要再次向您表达。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 有些问题你很也许很纳闷，比如说我为什么就和张总以及他的领导过不去呢？我为什么屡次三番来打电话给您反馈这些问题？</div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;1.每次因为讨论问题我和他或者虎哥争论后，我都会在接下来的一到两天内收到一些猎头的邮件或者电话，其中邀约最多的是teambition，其中一个电话就是那天我跟他聊了两个小时候，一个来自浙江的猎头打的，招我去teambition做架构师。我在进去小虎后，我的所有简历都隐藏了，且都是写的不会考虑其他机会。所以每当想到这点，而且每次都这么巧合的时候，我的心情就淡定不下来。再反过来看张总是如何对待公司其他老员工的，我得出的结论就是，这人无德无能领导我们。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 2.从技术层次上来说，我跟张总以及他手下的虎哥接触了那么长的时间，每天在一起讨论，我深深的清楚我们的张总以及虎哥肚子里有多少技术储备。我跟您一样从张总嘴里不止一次听过大数据等一些感觉很高大上的技术名词。最关键的是在不懂得情况下，我们的张总管的东西无比多，在我看来一个CTO是不需要去管这些的，之所以他今天我我们的关系处的如此紧张就是因为他总是喜欢管不该管的事，从一个不懂行的人的角度去指导技术人员，除了受到鄙视还会有什么呢。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 3.从一个员工的角度来说，我们做程序的很苦。我们来到公司，除了工资之外，更希望的是能通过自己的努力，能让自己随着公司的壮大，一步步的往上走。毕竟我们不能做一辈子编程的。我想这也是每个员工的普通心理。但是来到公司这八个月，没有看到我们的张总对我们的职业发展做出一个规章制度，反而任人唯亲。我们唯一能感到的就是，我们即便在这家公司做五年、做十年都不太会有太大的变化，我们还是一辈子做马龙。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 4.从工作安排的角度来讲，他的每次决策不是让我们觉得很兴奋，也不是让我们觉得很英明，给我的感觉就是反感。尤其是对人的安排上，不是让我们很好做事、做好事，也没有把合适的人放在合适的岗位上，更不要说专业的人做专业的事。</div><div>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 关于技术选型。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 科技公司归根结底分为两种：业务驱动型和技术驱动型。在业务驱动型的公司，所有的技术都是为业务服务的。在技术驱动型公司技术就是业务。而我们小虎金融属于典型的业务驱动型公司，业务规模决定了技术的规模，业务的发展程度决定了技术的发展程度。但是我们的张总来了之后，做出的技术选型都不是为了公司的业务发展，而是为了他那个政治目的而做的，选node.js是这样选recact native也是。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 另外我称张总的领导为抽风式的领导，某天张总看到了react就说要用react，某天看到了swift就要我们学swfit，而且是没有提前的缓冲学习，是马上就要上。我想说，作为一个技术人员，想要把一个技术吃透已经不容易，想要在短时间内把一个技术吃透，更是不容易，因为每一门技术不单只是一门技术语言，它是一个生态系统。我们不是神，对任何一门技术学习都是一个漫长的过程，少则一个月多则几年。而张总没有做过开发，每天就在那信口开河，不是在帮我们成长，是在增加我们的负担。而我们面对一个陌生的东西，不精通的东西做出来的产品已经项目又是什么样子。所有我必须说，盲目的追逐前卫技术本身就是一个错误，因为技术只是一个工具，重要的不在于技术本身，而在于掌握它的人。二在业务驱动型的公司，盲目的追求前卫技术，是在拿业务做实验。</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 还有我对张总持事不公非常不满，在公司的teambition上，宋飞被警告过、朱宗贵被警告过，但是我觉得张总手下某些人更应该被警告，但是每次到了这里，在张总嘴里的说的那些条条道理不见了。如果一个部门的评价体系是这样的，我觉得没人会觉得信服，更不会觉得幸福。</div><div>&nbsp; &nbsp; &nbsp;&nbsp;</div><div>&nbsp; &nbsp; &nbsp; &nbsp; 王总，我再也不好意思再向您说这些了。我跟你说这些，我并不想说我要想搞垮张总去接替他，我没这个本事，我也没想过，我只想让对的人来领导我们做对的事，比如我曾经觉得JUSTIN是这个对的人，但是就是这样对的人也走了。我来这也不是为了跟张总去较劲，那天您说您对张总很了解，但是从我跟他相处的这段时间来看，我的感觉完全跟您不一样，也许是站的角度不一样。但是我发自真心的想跟你说，我希望跟对人最对事，现在的局面不是我们想要的。</div>"
    }
  ]
}